/*
Navicat MySQL Data Transfer

Source Server         : localhost
Source Server Version : 50525
Source Host           : localhost:3306
Source Database       : lxbank

Target Server Type    : MYSQL
Target Server Version : 50525
File Encoding         : 65001

Date: 2014-05-15 14:21:11
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `account`
-- ----------------------------
DROP TABLE IF EXISTS `account`;
CREATE TABLE `account` (
  `accountId` int(11) NOT NULL AUTO_INCREMENT,
  `myAccountName` varchar(128) DEFAULT NULL,
  `myAccountNo` varchar(128) DEFAULT NULL,
  `cashType` varchar(128) DEFAULT NULL,
  `myAccountBank` varchar(128) DEFAULT NULL,
  `myAccountAlias` varchar(128) DEFAULT NULL,
  `myAccountType` varchar(128) DEFAULT NULL,
  PRIMARY KEY (`accountId`)
) ENGINE=InnoDB AUTO_INCREMENT=27 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of account
-- ----------------------------
INSERT INTO `account` VALUES ('1', '武汉张三科技有限公司', '42001237008050007480', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('2', '武汉李四科技有限公司', '42001237008050013120', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('3', '武汉王五科技有限公司', '422011700084011234', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('4', '武汉赵六科技有限公司', '4230117000853011234', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('5', '武汉刘奇科技有限公司', '42401170340853011234', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('6', '湖北张三科技有限公司', '425011704853011234', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('7', '湖北李四科技有限公司', '426011123011234', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('8', '湖北王五科技有限公司', '427011700084011234', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('9', '湖北赵六科技有限公司', '4280117000853011234', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('10', '湖北某某科技有限公司', '42901170340853011234', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('11', '湖南张三科技有限公司', '420111704853011234', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('12', '湖南李四科技有限公司', '420211700084011234', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('13', '湖南王五科技有限公司', '420311703453011234', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('14', '湖南赵六科技有限公司', '42041170340853011234', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('15', '湖南某某科技有限公司', '420511704853011234', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('16', '长沙张三科技有限公司', '420611704853011234', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('17', '长沙李四科技有限公司', '420711123011234', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('18', '长沙王五科技有限公司', '420811700084011234', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('19', '长沙赵六科技有限公司', '4209117000853011234', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('20', '长沙某某科技有限公司', '42001170340853011234', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('21', '上海张三科技有限公司', '420021704853011234', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('22', '上海李四科技有限公司', '420031700084011234', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('23', '上海王五科技有限公司', '420041703453011234', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('24', '上海赵六科技有限公司', '42005170340853011234', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('25', '上海某某科技有限公司', '420061704853011234', '人民币', '湖北省分行营业部', ' ', '签约账户');
INSERT INTO `account` VALUES ('26', '上海张三科技有限公司', '420071704853011234', '人民币', '湖北省分行营业部', ' ', '签约账户');

-- ----------------------------
-- Table structure for `accountdetail`
-- ----------------------------
DROP TABLE IF EXISTS `accountdetail`;
CREATE TABLE `accountdetail` (
  `adId` int(11) NOT NULL AUTO_INCREMENT,
  `accountDate` date DEFAULT NULL,
  `exchangeDate` datetime DEFAULT NULL,
  `voucherType` varchar(128) DEFAULT NULL,
  `voucher` varchar(128) DEFAULT NULL,
  `debitAmount` double DEFAULT NULL,
  `crebitAmount` double DEFAULT NULL,
  `balance` double DEFAULT NULL,
  `accountCaseFlag` varchar(128) DEFAULT NULL,
  `sendName` varchar(128) DEFAULT NULL,
  `sendNo` varchar(128) DEFAULT NULL,
  `summary` varchar(128) DEFAULT NULL,
  `comment` varchar(128) DEFAULT NULL,
  `serialNumber` varchar(128) DEFAULT NULL,
  `enterpriseSerialNumber` varchar(128) DEFAULT NULL,
  `myAccountNo` varchar(128) DEFAULT NULL,
  `myAccountName` varchar(128) DEFAULT NULL,
  `myAccountBank` varchar(128) DEFAULT NULL,
  `myAccountStatus` varchar(128) DEFAULT NULL,
  `accountDetailsId` varchar(128) DEFAULT NULL,
  PRIMARY KEY (`adId`)
) ENGINE=InnoDB AUTO_INCREMENT=99 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of accountdetail
-- ----------------------------
INSERT INTO `accountdetail` VALUES ('3', '2014-01-07', '2014-01-07 09:52:28', '建设银行电汇凭证', '', '0', '10000', '15768.06', '钞户', '湖北江海科技发展有限公司', '1812020319200036738', '转帐存入', '', '3517-420000018D050004564', '', '42001237008050007480', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);
INSERT INTO `accountdetail` VALUES ('4', '2014-01-07', '2014-01-07 10:01:38', '中国建设银行电子转账凭证', '020095202129', '6800', '0', '8968.06', '钞户', '武汉企业信用管理服务中心', '571657520087', '信用企业审报费', '信用企业审报费', '3518-4202370080PLAC1PE3D', '', '42001237008050007480', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);
INSERT INTO `accountdetail` VALUES ('5', '2014-01-07', '2014-01-07 10:01:38', '中国建设银行电子转账凭证', '020095202129', '1', '0', '8967.06', '钞户', '武汉企业信用管理服务中心', '', '手续费', '信用企业审报费', '3519-4202370080PLAC1PE3D', '', '42001237008050007480', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);
INSERT INTO `accountdetail` VALUES ('6', '2014-01-08', '2014-01-08 07:46:02', '', '9553302870016534', '300', '0', '8667.06', '钞户', '', '', '备用金', '', '3520-420206337A030000015', '', '42001237008050007480', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);
INSERT INTO `accountdetail` VALUES ('7', '2014-01-08', '2014-01-08 07:46:41', '', '9553302870016534', '2700', '0', '5967.06', '钞户', '', '', '备用金', '', '3521-420206337A030000016', '', '42001237008050007480', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);
INSERT INTO `accountdetail` VALUES ('8', '2014-01-09', '2014-01-09 18:02:55', '', '', '321.65', '0', '5645.41', '钞户', '批量代收业务资金集中过渡户', '10142000001822959900500051', '通讯费', '通讯费', '3522-420000018D390044247', '', '42001237008050007480', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);
INSERT INTO `accountdetail` VALUES ('9', '2014-01-13', '2014-01-13 11:39:49', '建设银行电汇凭证', '', '0', '21000', '26645.41', '钞户', '湖北江海科技发展有限公司', '1812020319200036738', '转帐存入', '', '3523-420000018D050013271', '', '42001237008050007480', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);
INSERT INTO `accountdetail` VALUES ('10', '2014-01-13', '2014-01-13 11:59:18', '建设银行电汇凭证', '', '0', '4000', '30645.41', '钞户', '湖北江海科技发展有限公司', '1812020319200036738', '转帐存入', '', '3524-420000018D050014604', '', '42001237008050007480', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);
INSERT INTO `accountdetail` VALUES ('11', '2014-01-13', '2014-01-13 16:54:44', '', '', '8296.62', '0', '22348.79', '钞户', '财库联网集中户', '10142000001824103500000011', '财税库行扣款交易', '财税库行扣款交易', '3525-4200000185OBACA7X06', '', '42001237008050007480', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);
INSERT INTO `accountdetail` VALUES ('12', '2014-01-13', '2014-01-13 16:55:04', '', '', '2576.33', '0', '19772.46', '钞户', '财库联网集中户', '10142000001824103500000011', '财税库行扣款交易', '财税库行扣款交易', '3526-42000001885NA3HLTFW', '', '42001237008050007480', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);
INSERT INTO `accountdetail` VALUES ('13', '2014-01-13', '2014-01-13 17:15:12', '', '', '10.89', '0', '19761.57', '钞户', '财库联网集中户', '10142000001824103500000011', '财税库行扣款交易', '财税库行扣款交易', '3527-42000001812FA896O82', '', '42001237008050007480', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);
INSERT INTO `accountdetail` VALUES ('14', '2014-01-13', '2014-01-13 17:15:14', '', '14598.08', '14598.08', '0', '5163.49', '钞户', '财库联网集中户', '10142000001824103500000011', '财税库行扣款交易 财税库行扣款交易', '', '3528-42000001885NA3OT7H5', '', '42001237008050007480', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);
INSERT INTO `accountdetail` VALUES ('87', '2014-01-07', '2014-01-07 09:52:28', '建设银行电汇凭证', '', '0', '10000', '15768.06', '钞户', '湖北江海科技发展有限公司', '1812020319200036738', '转帐存入', '', '3617-420000018D050004564', '', '42001237008050013120', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);
INSERT INTO `accountdetail` VALUES ('88', '2014-01-07', '2014-01-07 10:01:38', '中国建设银行电子转账凭证', '020095202129', '6800', '0', '8968.06', '钞户', '武汉企业信用管理服务中心', '571657520087', '信用企业审报费', '信用企业审报费', '3618-4202370080PLAC1PE3D', '', '42001237008050013120', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);
INSERT INTO `accountdetail` VALUES ('89', '2014-01-07', '2014-01-07 10:01:38', '中国建设银行电子转账凭证', '020095202129', '1', '0', '8967.06', '钞户', '武汉企业信用管理服务中心', '', '手续费', '信用企业审报费', '3619-4202370080PLAC1PE3D', '', '42001237008050013120', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);
INSERT INTO `accountdetail` VALUES ('90', '2014-01-08', '2014-01-08 07:46:02', '', '9553302870016534', '300', '0', '8667.06', '钞户', '', '', '备用金', '', '3620-420206337A030000015', '', '42001237008050013120', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);
INSERT INTO `accountdetail` VALUES ('91', '2014-01-08', '2014-01-08 07:46:41', '', '9553302870016534', '2700', '0', '5967.06', '钞户', '', '', '备用金', '', '3621-420206337A030000016', '', '42001237008050013120', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);
INSERT INTO `accountdetail` VALUES ('92', '2014-01-09', '2014-01-09 18:02:55', '', '', '321.65', '0', '5645.41', '钞户', '批量代收业务资金集中过渡户', '10142000001822959900500051', '通讯费', '通讯费', '3622-420000018D390044247', '', '42001237008050013120', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);
INSERT INTO `accountdetail` VALUES ('93', '2014-01-13', '2014-01-13 11:39:49', '建设银行电汇凭证', '', '0', '21000', '26645.41', '钞户', '湖北江海科技发展有限公司', '1812020319200036738', '转帐存入', '', '3623-420000018D050013271', '', '42001237008050013120', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);
INSERT INTO `accountdetail` VALUES ('94', '2014-01-13', '2014-01-13 11:59:18', '建设银行电汇凭证', '', '0', '4000', '30645.41', '钞户', '湖北江海科技发展有限公司', '1812020319200036738', '转帐存入', '', '3624-420000018D050014604', '', '42001237008050013120', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);
INSERT INTO `accountdetail` VALUES ('95', '2014-01-13', '2014-01-13 16:54:44', '', '', '8296.62', '0', '22348.79', '钞户', '财库联网集中户', '10142000001824103500000011', '财税库行扣款交易', '财税库行扣款交易', '3625-4200000185OBACA7X06', '', '42001237008050013120', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);
INSERT INTO `accountdetail` VALUES ('96', '2014-01-13', '2014-01-13 16:55:04', '', '', '2576.33', '0', '19772.46', '钞户', '财库联网集中户', '10142000001824103500000011', '财税库行扣款交易', '财税库行扣款交易', '3626-42000001885NA3HLTFW', '', '42001237008050013120', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);
INSERT INTO `accountdetail` VALUES ('97', '2014-01-13', '2014-01-13 17:15:12', '', '', '10.89', '0', '19761.57', '钞户', '财库联网集中户', '10142000001824103500000011', '财税库行扣款交易', '财税库行扣款交易', '3627-42000001812FA896O82', '', '42001237008050013120', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);
INSERT INTO `accountdetail` VALUES ('98', '2014-01-13', '2014-01-13 17:15:14', '', '', '14598.08', '0', '5163.49', '钞户', '财库联网集中户', '10142000001824103500000011', '财税库行扣款交易', '财税库行扣款交易', '3628-42000001885NA3OT7H5', '', '42001237008050013120', '武汉华顿科技有限公司', '武汉市武昌支行营业室', '正常', null);

-- ----------------------------
-- Table structure for `logging`
-- ----------------------------
DROP TABLE IF EXISTS `logging`;
CREATE TABLE `logging` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `log_date` datetime DEFAULT NULL,
  `log_level` varchar(64) DEFAULT NULL,
  `location` varchar(256) DEFAULT NULL,
  `message` varchar(1024) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=949 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of logging
-- ----------------------------
